---
title: RenderingImageExposureSettings
classe: Autodesk.Revit.DB.RenderingImageExposureSettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# RenderingImageExposureSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ExposureValue { get; set; }` | `renderingImageExposureSettings.ExposureValue` | Double |
| `Double Highlights { get; set; }` | `renderingImageExposureSettings.Highlights` | Double |
| `Boolean IsValidObject { get; }` | `renderingImageExposureSettings.IsValidObject` | Boolean |
| `Double Saturation { get; set; }` | `renderingImageExposureSettings.Saturation` | Double |
| `Double Shadows { get; set; }` | `renderingImageExposureSettings.Shadows` | Double |
| `Double WhitePoint { get; set; }` | `renderingImageExposureSettings.WhitePoint` | Double |
| `Void Dispose()` | `renderingImageExposureSettings.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```